Revit 2027 API
PDFExportOptions.FileName Property
 File name of the PDF when Combine is true.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public string FileName { get; set; }
Public Property FileName As String
	Get
	Set
public:
property String^ FileName {
	String^ get ();
	void set (String^ value);
}
member FileName : string with get, set
Property Value
String
Exceptions
Exception | Condition
ArgumentNullException |  When setting this property: A non-optional argument was null
Remarks
 PDF file extension (".pdf") would be automatically appended to the result file. When Combine is false, this would be ignored.
See Also
Reference
PDFExportOptions Class
Autodesk.Revit.DB Namespace